// JavaScript Strings


// এই অধ্যায়টি জাভাস্ক্রিপ্ট স্ট্রিং এবং স্ট্রিং অবজেক্ট নিয়ে আলোচনা করবে। এখানে আপনি স্ট্রিং এক্সেস, তুলনা, ডিকম্পোজিশন, এবং স্ট্রিং অনুসন্ধানের বিভিন্ন কার্যকরী পদ্ধতি শিখবেন। এছাড়া, স্ট্রিং এনকোডিং, ডিকোডিং, এনক্রিপশন এবং ডিক্রিপশন সম্পর্কেও আলোচনা করা হয়েছে। এই অধ্যায়ের শেষে, আপনি জাভাস্ক্রিপ্ট স্ট্রিং নিয়ে কাজ করার দক্ষতা অর্জন করবেন এবং স্ট্রিং এনকোডিং ও এনক্রিপশনের মৌলিক ধারণা সম্পর্কে বুঝতে পারবেন।


// জাভাস্ক্রিপ্ট স্ট্রিং প্রিমিটিভ

// জাভাস্ক্রিপ্টের স্ট্রিং প্রিমিটিভ একটি সহজাত ডেটা টাইপ, যা অনেক সাধারণ স্ট্রিং ফাংশনের সাথে আসে।


// স্ট্রিং অ্যাক্সেস:
    // .charAt() ব্যবহার করে একটি স্ট্রিংয়ের নির্দিষ্ট ক্যারেক্টার অ্যাক্সেস করা যায়।
    // 'dog'.charAt(1); // "o" রিটার্ন করে

    // .substring(startIndex, endIndex) দিয়ে একটি নির্দিষ্ট অংশ অ্যাক্সেস করা যায়।
    // 'YouTube'.substring(1,2); // 'o' রিটার্ন করে
    
// স্ট্রিং তুলনা:
    // স্ট্রিং তুলনার জন্য আপনি তুলনামূলক অপারেটর (<, >) ব্যবহার করতে পারেন।
    // var a = 'a';
    // var b = 'b';
    // console.log(a < b); // true রিটার্ন করে

// স্ট্রিং অনুসন্ধান:
    //.indexOf(searchValue[, fromIndex]) ব্যবহার করে স্ট্রিংয়ের মধ্যে একটি নির্দিষ্ট অংশ অনুসন্ধান করা যায়।
    //'Red Dragon'.indexOf('Red'); // 0 রিটার্ন করে

// স্ট্রিং ভাঙন:
    // var test1 = 'chicken,noodle,soup,broth';
    // test1.split(","); // ["chicken", "noodle", "soup", "broth"] রিটার্ন করে

// স্ট্রিং প্রতিস্থাপন:
    // .replace(string, replaceString) ব্যবহার করে একটি স্ট্রিংয়ের নির্দিষ্ট অংশ প্রতিস্থাপন করা যায়।
    // "Wizard of Oz".replace("Wizard","Witch"); // "Witch of Oz" রিটার্ন করে

// রেগুলার এক্সপ্রেশন:
    // রেগুলার এক্সপ্রেশন ব্যবহার করে আপনি স্ট্রিংয়ে প্যাটার্ন অনুসন্ধান করতে পারেন। উদাহরণস্বরূপ:
    // var str = "JavaScript DataStructures";
    // var n = str.search(/DataStructures/);
    // console.log(n); // 11 রিটার্ন করে

//এনকোডিং:
    // স্ট্রিং এনকোডিংয়ের মাধ্যমে ডেটা কম্প্যাক্ট করে পাঠানো যায়। Base64 এনকোডিং ব্যবহার করে একটি স্ট্রিং এনকোড করা সম্ভব।
    // btoa('hello'); // Base64-এ এনকোড করে



// এনক্রিপশন:
    // এনক্রিপশন হল ডেটা সুরক্ষিত করার একটি পদ্ধতি। আরএসএ (RSA) অ্যালগরিদমটি এনক্রিপশন এবং ডিক্রিপশনের জন্য ব্যবহৃত হয়, যা দুটি প্রাইম নম্বরের ভিত্তিতে কাজ করে।
    
    // এই অধ্যায়ের মাধ্যমে আপনি জাভাস্ক্রিপ্ট স্ট্রিং নিয়ে কাজ করার বিভিন্ন পদ্ধতি ও কৌশল শিখতে পারবেন, যা বাস্তব জীবনে অনেক কাজে লাগবে।
